'''Данная программа позволяет расчитать температуру на ЭРИ 
   в зависимости от температуры нагретой зоны, где установлен
   данный ЭРИ и температуры среды, окружающей нагретую зону
   
   Методика расчета и эмпирические коэффициенты для расчета 
   взяты из книги: Роткоп Л.Л., Спокаойный Ю.Е.
   Обеспечение тепловых режимов при конструировании 
   радиоэлектронной аппаратуры. М., "Сов. радио", 1976.

   Автор программы: Жирнов Игорь Анатольевич'''

from scipy.interpolate import interp1d
import numpy as np
from tkinter import *

class Application(Frame):
	def __init__(self, master):
		super(Application, self).__init__(master)
		self.grid()
		self.create_widgets()
	def create_widgets(self):
		#Метка с инструкцией к программе
		Label(self,
			  text = 'Данная программа с заданной вероятность позволяет определить ' \
			  'температуру на ЭРИ в зависимости от температуры воздуха, окружающего ' \
			  'нагретую зону, и температуры нагретой зоны при охлаждении естественной ' \
			  'конвекцией.',
			  ).grid(row = 0, column = 0, columnspan = 7, sticky = N)
		





VEL = np.linspace(0, 70, 15)
P999 = np.array([30., 35., 41., 48., 57., 67., 78., 90., 102., 114., 129., 145., 145., 145., 145.])
P995 = np.array([25., 30., 35., 42.5, 50., 57., 66., 76., 86., 97., 109., 122., 135., 150., 150.])
P099 = np.array([23.5, 27., 33., 39., 46., 53.5, 62., 70., 80., 88., 100., 112., 123., 135., 135.])
P098 = np.array([23., 26., 32., 37., 43., 50., 57., 66., 74., 83., 92., 103., 113., 124., 135.])
P097 = np.array([22., 25., 30., 35., 42., 48., 55., 63., 70., 78., 87., 96., 107., 117., 128.])
P096 = np.array([21., 24., 28., 34., 40., 46., 52.5., 60., 67., 75., 84., 92.5., 102., 112., 123.])
P095 = np.array([19., 23., 27., 32.5, 38., 44.5, 50.5, 57.5, 64., 72., 80., 87.5, 96.5, 105., 115.])
P098 = np.array([., ., ., ., ., ., ., ., ., ., ., ., ., ., .])



f = interp1d(x, y, kind = 'cubic')